trade_exp/src/DataProcessors/ЖурналДокументовЗакупки/ЖурналДокументовЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="be6c7627-3a81-434a-bccf-007a451c8959">
  <name>ЖурналДокументовЗакупки</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="44851db7-ace4-11e7-7088-f45c898df8f7">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="448617a8-ace4-11e7-7088-f45c898df8f7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862216-ace4-11e7-7088-f45c898df8f7">
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44862720-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4485debe-ace4-11e7-7088-f45c898df8f7">
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862c2a-ace4-11e7-7088-f45c898df8f7">
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861d0c-ace4-11e7-7088-f45c898df8f7">
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863652-ace4-11e7-7088-f45c898df8f7">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="448607f4-ace4-11e7-7088-f45c898df8f7">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863134-ace4-11e7-7088-f45c898df8f7">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861276-ace4-11e7-7088-f45c898df8f7">
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860d4e-ace4-11e7-7088-f45c898df8f7">
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c033ddc4-ace7-11e7-7088-f45c898df8f7">
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="831ffe7e-f3df-4095-a10b-b5fb3a077003">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="9db0faa0-6639-4188-b1ae-45947ea159fa">
    <name>СторноИсправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f67589b3-bd43-48f7-a0f9-db01f3da814e">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="448640c0-ace4-11e7-7088-f45c898df8f7">
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44864796-ace4-11e7-7088-f45c898df8f7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44867356-ace4-11e7-7088-f45c898df8f7">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44866bd6-ace4-11e7-7088-f45c898df8f7">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448698e0-ace4-11e7-7088-f45c898df8f7">
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448679be-ace4-11e7-7088-f45c898df8f7">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448692aa-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868666-ace4-11e7-7088-f45c898df8f7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868c92-ace4-11e7-7088-f45c898df8f7">
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СостоянияПоОбъектамУчетаЭДО/СостоянияПоОбъектамУчетаЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="94cb8fd8-e78e-4367-870e-e56a7e5e245d">
  <name>СостоянияПоОбъектамУчетаЭДО</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="9eb44008-3db8-4c27-940d-149dfe89ffe0">
    <name>СостояниеЭДО</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="cb90bdf4-c492-45ef-b596-12109e8f7847">
    <name>ПредставлениеСостояния</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="bb074754-23ca-4d93-98f1-533aec10d349">
    <name>СсылкаНаОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ДокументыСОшибкамиПроверкиКонтрагентов/ДокументыСОшибкамиПроверкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДокументыСОшибкамиПроверкиКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/СчетФактураПолученный/СчетФактураПолученный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СчетФактураПолученный</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИсправления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОтнестиКПредыдущемуОтчетномуКварталу</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерИсправления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СоставленКомиссионеромОтИмениПродавца</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаСоставления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПолученВЭлектронномВиде</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодВидаОперации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодВидаОперацииНаУменьшение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bd713d3d-c98e-4a8f-8fc2-b1329037384c">
    <name>ИННКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0e0ef7e6-411c-40a2-86d2-e56ca7b4d156">
    <name>ДатаЗаписиКнигиПродаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5cbabc52-e05c-4cd3-8a42-8fe436c507ab">
    <name>КППКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bf4dba77-3672-46ad-bedf-f8cd6afdd276">
    <name>Исправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea94de1e-2936-403e-9af0-91b7c8b55cd6">
    <name>Корректировочный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f21439d2-630c-4aa6-8315-b82887e6b36b">
    <name>ДатаЗаписиКнигиПокупок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="168d9b98-287a-4133-8c5b-69a0e3e88dcd">
    <name>ДатаСозданияДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e437a15a-4b1e-4319-853c-c6c06186ba9f">
      <name>СуммаУменьшениеКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="def81422-4b76-4f7e-9f90-35dd25d84733">
      <name>СуммаНДСКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dba954d2-ebe7-426b-9ef7-8cb412ca2ddd">
      <name>СуммаНДСУвеличениеКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0a25e3d2-8a1d-492a-9b20-42b5435226bf">
      <name>СуммаНДСУвеличение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f3378054-cd6e-48bc-844e-28d8529b3388">
      <name>ИсходныйДокумент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4b114798-fc5d-4d59-8476-11e0bb19352f">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b4d55bcb-508e-42ef-9074-65364bac4176">
      <name>СуммаУменьшение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ac88564b-289e-47ac-ae09-88366f9e6b74">
      <name>СуммаУвеличение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e40f2fdc-51ba-4290-a6d3-e44549a904af">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="12592a23-09f7-4fd2-8764-7b4f2950fdf0">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c04c4cfa-f7e9-4385-b3c3-3d10aeb2eac3">
      <name>СуммаНДСУменьшение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8842f868-82c5-4c50-b80c-adf5a575ffce">
      <name>СуммаКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="50686e73-d853-41f1-8bd5-d9461bcef0bf">
      <name>СуммаУвеличениеКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="adb14093-3806-459a-849d-5f1fa3d34976">
      <name>СуммаНДСУменьшениеКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="04176231-3718-4701-b1b2-11cef873d0dc">
      <name>ПринятоКВычетуНДСДоВводаОстатков</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3f913d02-0952-4656-a9c0-8b1c395bd8d5">
      <name>СтавкаНДСДоВводаОстатков</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="90f1c654-c4fb-454e-812e-65be36b93757">
      <name>ВидЦенности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c0d716d1-8496-4587-b452-04e67634da9e">
    <name>Продавцы</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

trade_exp/src/DataProcessors/ЖурналДокументовЗакупки/Forms/СписокДокументов/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	СписокДокументыЗакупки.ТекстЗапроса = СтрЗаменить(СписокДокументыЗакупки.ТекстЗапроса, "ЗНАЧЕНИЕ(Перечисление.СтатусыДокументаЭДО.ПустаяСсылка)",	
		"	ВЫБОР
		|		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ПриобретениеТоваровУслуг ИЛИ 
		|				РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов ИЛИ
		|				РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.КорректировкаПриобретения
		|			ТОГДА РеестрДокументовПереопределяемый.Ссылка.СтатусДокументаВЭДО
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыДокументаЭДО.ПустаяСсылка)
		|	КОНЕЦ
		|");      
	
	БлокируемыеПоля = Новый Массив;
	БлокируемыеПоля.Добавить("СуммаНДС");
	БлокируемыеПоля.Добавить("НомерСФ");
	БлокируемыеПоля.Добавить("ДатаСФ");
	
	СписокДокументыЗакупки.УстановитьОграниченияИспользованияВГруппировке(БлокируемыеПоля);
	СписокДокументыЗакупки.УстановитьОграниченияИспользованияВОтборе(БлокируемыеПоля);
	СписокДокументыЗакупки.УстановитьОграниченияИспользованияВПорядке(БлокируемыеПоля);
	
	Элементы.СтатусВЭДО.СписокВыбора.Очистить();
	Элементы.СтатусВЭДО.СписокВыбора.Добавить(Перечисления.СтатусыДокументаЭДО.Подписан);
	Элементы.СтатусВЭДО.СписокВыбора.Добавить(Перечисления.СтатусыДокументаЭДО.НеПодписан);
КонецПроцедуры

#Область ПолучитьДопПоляДляСписокДокументыЗакупки

&НаСервере
&ИзменениеИКонтроль("ТекстЗапросаСписокДокументыЗакупки")
Функция Док_ТекстЗапросаСписокДокументыЗакупки()
	
#Вставка
	СписокДокументыЗакупки.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ХозяйственныеОперацииИДокументы",	
	ХозяйственныеОперацииИДокументы.Выгрузить(, "ПолноеИмяДокумента").ВыгрузитьКолонку(0));
#КонецВставки
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РеестрДокументов.Ссылка КАК Ссылка,
	|	РеестрДокументов.НомерДокументаИБ КАК Номер,
	|	РеестрДокументов.ДатаДокументаИБ КАК Дата,
	|	РеестрДокументов.Статус,
	|	РеестрДокументов.Проведен,
	|	РеестрДокументов.ПометкаУдаления,
	|	РеестрДокументов.ХозяйственнаяОперация,
	|	РеестрДокументов.Партнер,
	|	ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.Контрагенты) КАК Контрагент,
	|	РеестрДокументов.Контрагент КАК КонтрагентКлюч,
	|	РеестрДокументов.Договор,
	|	&Соглашение КАК Соглашение,
	|	РеестрДокументов.Организация,
	|	РеестрДокументов.Подразделение,
	|	РеестрДокументов.МестоХранения КАК МестоХранения,
	|	ВЫРАЗИТЬ(РеестрДокументов.МестоХранения.Ключ КАК Справочник.Склады) КАК Склад,
	|	РеестрДокументов.Валюта,
	|	РеестрДокументов.Сумма КАК СуммаДокумента,
	|	РеестрДокументов.Ответственный КАК Менеджер,
	|	РеестрДокументов.Автор КАК Автор,
	|	РеестрДокументов.Комментарий,
	|	РеестрДокументов.НомерПервичногоДокумента КАК НомерВходящегоДокумента,
	|	РеестрДокументов.ДатаПервичногоДокумента КАК ДатаВходящегоДокумента,
	|	РеестрДокументов.Дополнительно,
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|	СостоянияЭД.СостояниеЭДО,
	|	СостоянияЭД.ПредставлениеСостояния КАК ПредставлениеСостояния,	
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|	ВЫБОР
	|		КОГДА ДокументыСОшибкамиПроверкиКонтрагентов.Документ ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиПроверкиКонтрагентов,
	|	ВЫБОР
	|		КОГДА РеестрДокументов.Проведен
	|			ТОГДА 0
	|		КОГДА РеестрДокументов.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК НестандартнаяКартинка,
	|	РеестрДокументов.ДополнительнаяЗапись,
	|	РеестрДокументов.ТипСсылки КАК ТипСсылки,
	#Вставка
	|	ВЫБОР
	|		КОГДА РеестрДокументов.Ссылка ССЫЛКА Документ.ПриобретениеТоваровУслуг ИЛИ 
	|				РеестрДокументов.Ссылка ССЫЛКА Документ.ПриобретениеУслугПрочихАктивов ИЛИ
	|				РеестрДокументов.Ссылка ССЫЛКА Документ.КорректировкаПриобретения
	|			ТОГДА РеестрДокументов.Ссылка.СтатусДокументаВЭДО
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыДокументаЭДО.ПустаяСсылка)
	|	КОНЕЦ КАК СтатусДокументаВЭДО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК НомерСФ,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаСФ,
	#КонецВставки
	|	ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) КАК ТипЗначения,
	|	&СтатусПроверки КАК СтатусПроверки,
	|	&ИндикаторПроверки КАК ИндикаторПроверки,
	|	РеестрДокументов.СторноИсправление КАК СторноИсправление,
	|	ВЫБОР
	|		КОГДА НЕ РеестрДокументов.СторноИсправление
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеестрДокументов.СторнируемыйДокумент
	|	КОНЕЦ КАК СторнируемыйИсправляемыйДокумент,
	|	РеестрДокументов.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	|	NULL КАК СостояниеОригиналаПервичногоДокумента,
	|	ИСТИНА КАК ОбщееСостояние,
	|	0 КАК СостояниеОригиналПолучен,
	|	ВЫРАЗИТЬ("""" КАК Строка(50)) КАК СостояниеГИСМТ
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	|{ГДЕ
	|	РеестрДокументов.Ссылка.* КАК Ссылка,
	|	РеестрДокументов.МестоХранения.* КАК МестоХранения,
	|	ВЫРАЗИТЬ(РеестрДокументов.МестоХранения.Ключ КАК Справочник.Склады).* КАК Склад,
	|	РеестрДокументов.Организация.* КАК Организация,
	|	РеестрДокументов.ДатаДокументаИБ КАК Дата,
	|	РеестрДокументов.НомерДокументаИБ КАК Номер,
	|	РеестрДокументов.Статус КАК Статус,
	|	РеестрДокументов.ТипСсылки КАК ТипСсылки,
	|	РеестрДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РеестрДокументов.Партнер.* КАК Партнер,
	|	ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.Контрагенты).* КАК Контрагент,
	|	РеестрДокументов.Договор.* КАК Договор,
	|	&Соглашение КАК Соглашение,
	|	РеестрДокументов.Подразделение.* КАК Подразделение,
	|	РеестрДокументов.Ответственный.* КАК Менеджер,
	|	РеестрДокументов.Автор.* КАК Автор,
	|	РеестрДокументов.Дополнительно КАК Дополнительно,
	|	РеестрДокументов.Комментарий КАК Комментарий,
	|	РеестрДокументов.Проведен КАК Проведен,
	|	РеестрДокументов.ПометкаУдаления КАК ПометкаУдаления,
	|	(РеестрДокументов.ДатаДокументаИБ >= &НачалоПериода
	|	И РеестрДокументов.ДатаДокументаИБ <= &КонецПериода)}
	|ИЗ
	|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		{
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
	|		ПО (СостоянияЭД.СсылкаНаОбъект = РеестрДокументов.Ссылка)
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыСОшибкамиПроверкиКонтрагентов КАК ДокументыСОшибкамиПроверкиКонтрагентов
	|		ПО РеестрДокументов.Ссылка = ДокументыСОшибкамиПроверкиКонтрагентов.Документ
	|		И (&ИспользованиеПроверкиВозможно)}";
	
	Возврат ТекстЗапроса;
КонецФункции   

&НаСервереБезКонтекста
Процедура ПолучитьШаблонЗапроса(ТекстЗапроса, ПоследняяИтерация = Ложь)
	
	Если ПоследняяИтерация Тогда ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Док.Ссылка КАК Ссылка,
		|	Док.ДокументОснование КАК ДокументОснование,
		|	СУММА(ЕСТЬNULL(Док.СуммаНДС, 0)) КАК СуммаНДС,
		|	Док.Ссылка.Номер КАК НомерСФ,
		|	НАЧАЛОПЕРИОДА(Док.Ссылка.ДатаСоставления, ДЕНЬ) КАК ДатаСФ
		|ПОМЕСТИТЬ ВТСчетФактураПолученный
		|ИЗ
		|	Документ.СчетФактураПолученный.ДокументыОснования КАК Док
		|ГДЕ
		|	(Док.Ссылка В (&мСтроки) ИЛИ Док.ДокументОснование В (&мСтроки))
		|	И НЕ Док.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Док.Ссылка,
		|	Док.ДокументОснование,
		|	Док.Ссылка.Номер,
		|	НАЧАЛОПЕРИОДА(Док.Ссылка.ДатаСоставления, ДЕНЬ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Док.ДокументОснование КАК ДокументОснование,
		|	МАКСИМУМ(Док.НомерСФ) КАК НомерСФ,
		|	МАКСИМУМ(Док.ДатаСФ) КАК ДатаСФ
		|ПОМЕСТИТЬ ВТСчетФактураПолученныйИтог
		|ИЗ
		|	ВТСчетФактураПолученный КАК Док
		|
		|СГРУППИРОВАТЬ ПО
		|	Док.ДокументОснование
		|	
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОснование
		|;
		|////////////////////////////////////////////////////////////////////////////////
		| " + ТекстЗапроса;
	КонецЕсли;
	
	Если Не ПоследняяИтерация И Не ЗначениеЗаполнено(ТекстЗапроса) Тогда ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Итог.Ссылка КАК Ссылка,
		|	СУММА(Итог.СуммаНДС) КАК СуммаНДС,
		|	ЕСТЬNULL(СчетФактураПолученный.НомерСФ, """") КАК НомерСФ,
		|	ЕСТЬNULL(СчетФактураПолученный.ДатаСФ, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСФ
		|ИЗ
		|	(ВЫБРАТЬ
		|		Док.Ссылка КАК Ссылка,
		|		ЕСТЬNULL(Док.СуммаНДС, 0) КАК СуммаНДС
		|	ИЗ
		|		<НаименованиеДокумента><ТабЧасть> КАК Док
		|	ГДЕ
		|		Док.Ссылка В (&мСтроки)
		|";
	ИначеЕсли Не ПоследняяИтерация И ЗначениеЗаполнено(ТекстЗапроса) Тогда ТекстЗапроса = ТекстЗапроса + " 
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Док.Ссылка,
		|		ЕСТЬNULL(Док.СуммаНДС, 0)
		|	ИЗ
		|		<НаименованиеДокумента><ТабЧасть> КАК Док
		|	ГДЕ
		|		Док.Ссылка В (&мСтроки)
		|";
	Иначе ТекстЗапроса = ТекстЗапроса + "	
		|
		|	) КАК Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСчетФактураПолученныйИтог КАК СчетФактураПолученный
		|		ПО (СчетФактураПолученный.ДокументОснование = Итог.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Итог.Ссылка,
		|	ЕСТЬNULL(СчетФактураПолученный.НомерСФ, """"),
		|	ЕСТЬNULL(СчетФактураПолученный.ДатаСФ, ДАТАВРЕМЯ(1, 1, 1))";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДопПоляДляЗапроса(ХозяйственныеОперацииИДокументы)      
	
	ТекстЗапроса = "";
	Для Каждого Элемент Из ХозяйственныеОперацииИДокументы Цикл

		Если Элемент = "Документ.СчетФактураПолученный" Тогда
			Если СтрНайти(ТекстЗапроса, "ВТСчетФактураПолученный") <> 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПолучитьШаблонЗапроса(ТекстЗапроса);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<НаименованиеДокумента>", "ВТСчетФактураПолученный");
		ИначеЕсли СтрНайти(ТекстЗапроса, Элемент) <> 0 Тогда
			Продолжить;
		ИначеЕсли Элемент = "Документ.ПриемкаТоваровНаХранение" ИЛИ
			Элемент = "Документ.ОтчетОСписанииТоваровСХранения" ИЛИ
			Элемент = "Документ.ОтгрузкаТоваровСХранения"  Тогда
			Продолжить;	
		Иначе
			ПолучитьШаблонЗапроса(ТекстЗапроса);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<НаименованиеДокумента>", Элемент);
		КонецЕсли;
	
		// <ТабЧасть> 
		Если Элемент = "Документ.ПриобретениеУслугПрочихАктивов" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<ТабЧасть>", ".Расходы");
		ИначеЕсли Элемент = "Документ.СчетФактураПолученный" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<ТабЧасть>", "");
		ИначеЕсли Элемент = "Документ.СчетФактураПолученныйНалоговыйАгент" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<ТабЧасть>", ".ДокументыОснования");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<ТабЧасть>", ".Товары");
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		ПолучитьШаблонЗапроса(ТекстЗапроса, Истина);
	КонецЕсли;         
	
	Возврат ТекстЗапроса;

КонецФункции 

&НаСервереБезКонтекста
Процедура Док_СписокДокументыЗакупкиПриПолученииДанныхНаСервереПосле(ИмяЭлемента, Настройки, Строки)
	
	ХозяйственныеОперацииИДокументы = Неопределено;
	Настройки.ДополнительныеСвойства.Свойство("ХозяйственныеОперацииИДокументы", ХозяйственныеОперацииИДокументы);  
	
	Запрос = Новый Запрос(ПолучитьДопПоляДляЗапроса(ХозяйственныеОперацииИДокументы));
	Ключи = Строки.ПолучитьКлючи();
	
	ДопПоля = Новый ТаблицаЗначений;
	ДопПоля.Колонки.Добавить("Ссылка");
	ДопПоля.Колонки.Добавить("СтрокаСписка");
	   
	Для Каждого Стр Из Ключи Цикл 
		НЗ = ДопПоля.Добавить();
		НЗ.Ссылка = Стр.Ссылка;
		НЗ.СтрокаСписка = Строки[Стр];
	КонецЦикла;
	
	Запрос.УстановитьПараметр("мСтроки", ДопПоля.ВыгрузитьКолонку("Ссылка"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Поиск = ДопПоля.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));
		Для Каждого Стр Из Поиск Цикл    
			Данные = Стр.СтрокаСписка.Данные;
			Если Данные.Свойство("СуммаНДС") Тогда
				Данные.СуммаНДС = Выборка.СуммаНДС;
			КонецЕсли;
			Если Данные.Свойство("НомерСФ") Тогда
				Данные.НомерСФ = Выборка.НомерСФ;
			КонецЕсли;
			Если Данные.Свойство("ДатаСФ") Тогда
				Данные.ДатаСФ = Выборка.ДатаСФ;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Док_УстановитьСтатусПодписаноПосле(Команда)   
	УстановитьСтатус("Подписан");
КонецПроцедуры

&НаКлиенте
Процедура Док_УстановитьСтатусНеподписаноПосле(Команда)      
	УстановитьСтатус("НеПодписан");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(Статус)	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.СписокДокументыЗакупки);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;                                
	
	СтатусУстановлен = Ложь;
	
	Для Каждого ДокументСтр Из ВыделенныеСтроки Цикл
		Если УстановитьСтатусНаДокумент(ДокументСтр, Статус) Тогда
			СтатусУстановлен = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если СтатусУстановлен Тогда
		Элементы.СписокДокументыЗакупки.Обновить();
	КонецЕсли;
КонецПроцедуры    

&НаСервере
Функция УстановитьСтатусНаДокумент(ДокументСтр, Статус)
	
	СтатусУстановлен = Ложь;
	
	ДокументОбъект = ДокументСтр.Ссылка.ПолучитьОбъект();
	МетаданныеОбъекта = ДокументОбъект.Метаданные();
	
	Если Общегоназначения.ЕстьРеквизитОбъекта("СтатусДокументаВЭДО",МетаданныеОбъекта) Тогда
		
		Если ДокументОбъект.СтатусДокументаВЭДО <> Перечисления.СтатусыДокументаЭДО[Статус]  Тогда
			
			Если ДокументОбъект.СтатусДокументаВЭДО <> Перечисления.СтатусыДокументаЭДО.Подписан Тогда	
				
				СтатусУстановлен = Истина;
		
				ДокументОбъект.СтатусДокументаВЭДО = Перечисления.СтатусыДокументаЭДО[Статус];
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
				ДопМодуль.ОбработатьЛистСогласованияПоДокументу(Статус, ДокументСтр.Ссылка);	
			Иначе
				Сообщить("У документа " + ДокументОбъект.Ссылка + " cтатус ""Подписан"" не может быть изменен");
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Сообщить("Для документа " + ДокументОбъект.Ссылка + " не предусмотрена установка статуса");
	КонецЕсли;
	
	Возврат СтатусУстановлен;

КонецФункции

&НаКлиенте
Процедура Док_СтатусВЭДОПриИзмененииПосле(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокДокументыЗакупки,
		"СтатусДокументаВЭДО", 
		СтатусВЭДО, 
		ВидСравненияКомпоновкиДанных.Равно,
		, 
		ЗначениеЗаполнено(СтатусВЭДО));
КонецПроцедуры
